In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import psycopg2
from sqlalchemy import create_engine

#initiate connection to the database
connct = psycopg2.connect('dbname=WhiskyAdvocate user= postgres password = [redacted] host = 127.0.0.1 port=5432')

#create sqlalchemy engine for querying the database
engine = create_engine('postgresql://postgres:[redacted]@localhost/WhiskyAdvocate')

What are the Names and Scores of The Reviewer's favorite Bourbons under $200?

In [13]:
#write a query to answer this question

bourb_query = '''SELECT whiskey_stats.name, whiskey_stats.score, whiskey_stats.price_usd, categories.category
                 FROM whiskey_stats
                 INNER JOIN categories
                 ON categories.category_id = whiskey_stats.category_id
                 WHERE categories.category = 'Bourbon/Tennessee' AND whiskey_stats.price_usd < 200 AND whiskey_stats.score > 90
                 ORDER BY (whiskey_stats.score) DESC;'''

fave_bourbs = pd.read_sql(bourb_query, connct)

print(f'there are {len(fave_bourbs)} that fit these criteria')
fave_bourbs.head()

there are 310 that fit these criteria

,name,score,price_usd,category
0,Four Roses Limited Edition Small Batch (2013 R...,97,85.0,Bourbon/Tennessee
1,Parker's Heritage Collection 'Golden Anniversa...,97,150.0,Bourbon/Tennessee
2,Jefferson's Presidential Select (Batch #1) 199...,96,90.0,Bourbon/Tennessee
3,Four Roses Limited Edition Small Batch (2012 R...,96,90.0,Bourbon/Tennessee
4,William Larue Weller 67.4%,96,65.0,Bourbon/Tennessee

What are the Names and Scores of The Reviewer's favorite single malt scotches under $200?

In [16]:
sms_query = '''SELECT whiskey_stats.name, whiskey_stats.score, whiskey_stats.price_usd, categories.category
                 FROM whiskey_stats
                 INNER JOIN categories
                 ON categories.category_id = whiskey_stats.category_id
                 WHERE categories.category = 'Single Malt Scotch' AND whiskey_stats.price_usd < 200 AND whiskey_stats.score > 90
                 ORDER BY (whiskey_stats.score) DESC;'''

fave_sms = pd.read_sql(sms_query, connct)

print(f'there are {len(fave_sms)} that fit these criteria')
fave_sms.head()

there are 214 that fit these criteria

,name,score,price_usd,category
0,Kilchoman Machir Bay Cask-Strength Festive Edi...,95,75.0,Single Malt Scotch
1,Ardbeg Corryvreckan 57.1%,95,90.0,Single Malt Scotch
2,Highland Park 18 year old 43%,94,112.0,Single Malt Scotch
3,Arran Sherry Cask The Bodega Cask-Strength 55.8%,94,80.0,Single Malt Scotch
4,Lagavulin 12 year old (Diageo Special Release...,94,130.0,Single Malt Scotch

Suppose I want a smokey and complex whisky for my mother's birthday party. What would be some good choices according to my score data?

In [20]:
scw_query = '''SELECT whiskey_stats.name, whiskey_stats.score, whiskey_stats.price_usd, categories.category
                FROM whiskey_stats
                INNER JOIN categories
                ON categories.category_id = whiskey_stats.category_id
                INNER JOIN vector_description
                ON vector_description.whiskey_id = whiskey_stats.whiskey_id
                WHERE whiskey_stats.price_usd < 200 AND vector_description.smoke > 0 AND vector_description.complex > 0
                ORDER BY (whiskey_stats.score) DESC;'''

fave_scw = pd.read_sql(scw_query, connct)

print(f'there are {len(fave_scw)} that fit these criteria')
fave_scw.head()

there are 34 that fit these criteria

,name,score,price_usd,category
0,Compass Box Flaming Heart (10th Anniversary bo...,95,105.0,Blended Malt Scotch Whisky
1,Lagavulin 12 year old (Diageo Special Releases...,94,109.0,Single Malt Scotch
2,Yamazaki 18 year old 43%,93,100.0,Japanese Whisky
3,Highland Park 21 year old 47.5%,93,100.0,Single Malt Scotch
4,Belle Meade 10 year old Sherry Cask Finish 53.2%,93,100.0,Bourbon/Tennessee

How many whiskeys in each category have the reviewers reviewed?

In [33]:
Au_stats_query = ''' SELECT authors.author, count(categories.category_id), categories.category
                        FROM authors
                        INNER JOIN reviews
                        ON authors.author_id = reviews.author_id
                        INNER JOIN whiskey_stats
                        ON reviews.whiskey_id = whiskey_stats.whiskey_id
                        INNER JOIN categories
                        ON whiskey_stats.category_id = categories.category_id
                        GROUP BY categories.category, authors.author
                        ORDER BY authors.author, count(categories.category_id) DESC;'''

aut_rev_stat = pd.read_sql(Au_stats_query, connct)


aut_rev_stat.head()

          author  count                      category
0  Adam Polonski      7                 Craft Whiskey
1  Adam Polonski      4                   Rye Whiskey
2  Adam Polonski      3  Single Malt American Whiskey
3  Adam Polonski      3          Multinational Whisky
4  Adam Polonski      1             Bourbon/Tennessee